АлогистикТест2/src/DataProcessors/алк_РМ_НачальникаСмены/алк_РМ_НачальникаСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РМ_НачальникаСмены</name>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проблемы</name>
    <attributes>
      <name>Проблема</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеСведенияПоУчасткам/алк_ДополнительныеСведенияПоУчасткам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеСведенияПоУчасткам</name>
  <comment>используется в рм мастера для ввода проблем</comment>
  <resources>
    <name>Проблема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/DataProcessors/алк_РМ_НачальникаСмены/Forms/Форма/Module.bsl
&НаСервере
Процедура ПроблемыПриИзмененииНаСервере() 	
	
	РегистрыСведений.алк_ДополнительныеСведенияПоУчасткам.ЗаписатьДопСведения(Объект.ДатаСмены, Объект.Смена,
		Справочники.алк_Участки.ПустаяСсылка(), Объект.Проблемы.Выгрузить());
		
КонецПроцедуры

&НаКлиенте
Процедура ПроблемыПриИзменении(Элемент)
	ПроблемыПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ДатаСменыПриИзмененииНаСервере()
	//Заполняем проблемы участка	
	Объект.Проблемы.Загрузить(РегистрыСведений.алк_ДополнительныеСведенияПоУчасткам.ВернутьПроблемыУчастка(Объект.ДатаСмены
			,Объект.Смена, Справочники.алк_Участки.ПустаяСсылка()));   
	//\\
КонецПроцедуры


&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	ДатаСменыПриИзмененииНаСервере();
КонецПроцедуры
